In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('spam_ham_dataset.csv')

In [3]:
df.head(2)

,Unnamed: 0,label,text,label_num
0,605,ham,Subject: enron methanol ; meter # : 988291\r\n...,0
1,2349,ham,"Subject: hpl nom for january 9 , 2001\r\n( see...",0

In [4]:
df.drop(['Unnamed: 0','label'],axis=1,inplace=True)

In [5]:
df.head(2)

                                                text  label_num
0  Subject: enron methanol ; meter # : 988291\r\n...          0
1  Subject: hpl nom for january 9 , 2001\r\n( see...          0

In [6]:
df['text'][100]

'Subject: help !\r\nbrian ,\r\nwho do i talk to about getting daren farmer a labor distribution report . he\r\nneeds to see what employees are hitting his rc . i know that we have\r\ndiscussed this prior and soem managers are receiving a monthly report but he\r\nis not . who can help us ? ? ?\r\nthank you !\r\nyvette\r\nx 3 . 5953'

In [7]:
import string
exclude=string.punctuation

def remove_punctuations(text):
    return text.translate(str.maketrans('','',exclude))

In [8]:
remove_punctuations(df['text'][0])

'Subject enron methanol  meter   988291\r\nthis is a follow up to the note i gave you on monday  4  3  00  preliminary\r\nflow data provided by daren  \r\nplease override pop  s daily volume  presently zero  to reflect daily\r\nactivity you can obtain from gas control \r\nthis change is needed asap for economics purposes '

In [9]:
df['text']=df['text'].apply(remove_punctuations)

In [10]:
import re
def remove_numbers_from_string(input_string):
    result_string = re.sub(r'\d+', '', input_string)
    return result_string
df['text']=df['text'].apply(remove_numbers_from_string)

In [11]:
def ll(obj):
    obj=obj.replace('Subject','')
    obj=obj.replace('\r\n','')
    obj=obj.replace('   ','')
    obj=obj.replace('  ',' ')

    obj=obj.strip(' ')

    return obj

In [12]:
df['text']=df['text'].apply(ll)

In [13]:
df.head(2)

                                                text  label_num
0  enron methanol meterthis is a follow up to the...          0
1  hpl nom for january see attached file hplnolxl...          0

In [14]:
from sklearn.feature_extraction.text import CountVectorizer
cv=CountVectorizer(max_features=5000,stop_words='english')

In [15]:
cv.fit_transform(df['text']).toarray()

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [16]:
df1=pd.DataFrame(data=cv.fit_transform(df['text']).toarray(),columns=cv.get_feature_names_out())
df2=pd.concat([df1,df['label_num']],axis=1)

In [17]:
df1.head(1)

,aa,aallen,abacustech,abdv,ability,able,absence,absolute,absolutely,ac,...,yvettex,zajac,zero,zeroed,zeroes,zimbabwe,zivley,zone,zonedubai,zonewww
0,0,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0

In [18]:
X=df2.iloc[:,:-1]
y=df2.iloc[:,-1]
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,random_state=42,test_size=0.20)
from sklearn.neighbors import KNeighborsClassifier
kn=KNeighborsClassifier(n_neighbors=15)
kn.fit(X_train,y_train)
from sklearn.metrics import accuracy_score

In [19]:
print(kn.score(X_train,y_train),',',kn.score(X_test,y_test))

0.7611218568665378 , 0.7391304347826086

In [20]:
df.iloc[120:121,:]

                                                text  label_num
120  txu noms forsee attached file hplnoxls hplnoxls          0

In [21]:

pd.set_option('display.max_rows',None)
pd.set_option('display.max_columns',None)

a=df.iloc[89:90,:-1].values
a

array([['quack see attached file duck hunting mpe duck hunting mpe']],
      dtype=object)

In [22]:
a=str(a)

In [23]:
a=remove_punctuations(a)
a

'quack see attached file duck hunting mpe duck hunting mpe'

In [24]:
a=remove_numbers_from_string(a)
a

'quack see attached file duck hunting mpe duck hunting mpe'

In [25]:
a=[ll(a)]
a

['quack see attached file duck hunting mpe duck hunting mpe']

In [26]:
cv.transform(a).toarray()

array([[0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [27]:
df5=pd.DataFrame(data=cv.transform(a).toarray(),columns=cv.get_feature_names_out())

In [28]:
kn.predict(df5)

array([1], dtype=int64)

In [29]:
def check(give):
    give=remove_punctuations(give)
    give=remove_numbers_from_string(give)

    give=[ll(give)]
    df5=pd.DataFrame(data=cv.transform(give).toarray(),columns=cv.get_feature_names_out())
    return kn.predict(df5)

In [30]:
df.iloc[500:501,:]

                                                  text  label_num
500  fwd screw doctors stocks available vlagrx a na...          1

In [31]:
check("Dear All,Greetings!!Company: WNS Global Services (P) Ltd Stipend during Internship – 18k per month fixed + monthly performance incentive upto 8500/- (performance based)CTC on conversion to Full-time employment – INR. 3.5lpa fixed + monthly performance incentive (performance based)Interested students can register in the link given below latest by 5 pm today. Test tonight & Final interview on Wednesday at GL Bajaj Gr.NoidaRegistration Link : https://forms.gle/f7PcQsmsbZF8ATsC7 Please find the Attached  Job Description for which we are looking to hire B.tech,BBA, BCA graduates from both batch 2023 and 2024. Below are the job details Selection Process:·         Online Aptitude assessment·         Online MCQ based assessment·         Domain/ PPT based assessment (On campus/ In office)·         Ops Interview (In person)Date Of Joining – 26th Oct’23--Warm Regards,Sunil ChourasiaGeneral Manager (Placements)G.L.Bajaj Institute of Technology & Management")

array([1], dtype=int64)